FV2504/E_0527.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.29.4: AD: Bestellung einer Konfiguration vom NB an MSB</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0527</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> MSB</B></FONT><BR align="center"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Liegt die Bestellte Konfiguration zum bestellten Zeitpunkt an der / bzw. allen Lokationen bereits vor?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die bestellte Konfiguration liegt bereits vor<BR align="left"/></FONT>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Erlaubt die vorhandene Gerätetechnik die Konfiguration zum bestellten Zeitpunkt?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die vorhandene Gerätetechnik erlaubt die Konfiguration zum bestellten Zeitpunkt nicht.<BR align="left"/>Hinweis:<BR align="left"/>Wenn die Gerätetechnik eine detailliertere Auflösung als die bestellten Werte bereitstellt, kann diese nicht abgelehnt werden. <BR align="left"/>Beispiel: Messung bietet Lastgang 1/4h Auflösung. Geforderte Werte sind kumulierte Werte.<BR align="left"/></FONT>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>30: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A99" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A99</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.04.2026 00:00 Uhr<BR align="left"/></FONT>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Die Einrichtung der Konfiguration ist grundsätzlich möglich<BR align="left"/></FONT>>];

    "Start" -> "10";
    "10" -> "A01" [label="Ja"];
    "10" -> "20" [label="Nein"];
    "20" -> "A02" [label="Nein"];
    "20" -> "30" [label="Ja"];
    "30" -> "A99" [label="Ja"];
    "30" -> "A03" [label="Nein"];

    bgcolor="transparent";
}
